<template>
    <main-content-page-layout>
        <article class="article-page-content">
            <h1>Публичная оферта</h1>
            <p>Настоящее пользовательское соглашение (далее – "Соглашение") является публичной офертой ООО "PROBILET OFFLINE" (далее – "Компания") и устанавливает условия использования услуг, предоставляемых Компанией.</p>
            <ol>
                <li>
                    Общие положения
                    <ol>
                        <li>Настоящее Соглашение регулирует отношения между Компанией и пользователями (далее – "Пользователь") в процессе использования сервиса продажи билетов, предоставляемого Компанией.</li>
                        <li>Настоящее Соглашение является публичной офертой в соответствии со статьей 437 Гражданского кодекса Российской Федерации. Регистрация в сервисе и/или использование его функционала означает полное и безоговорочное принятие Пользователем условий настоящего Соглашения.</li>
                    </ol>
                </li>
                <li>
                    Права и обязанности сторон
                    <ol>
                        <li>Компания обязуется предоставить Пользователю доступ к сервису продажи билетов и обеспечить его бесперебойное функционирование, за исключением случаев проведения технических работ или возникновения форс-мажорных обстоятельств.</li>
                        <li>Пользователь обязуется соблюдать условия настоящего Соглашения, предоставлять достоверную информацию при регистрации и использовании сервиса, а также не предпринимать действий, направленных на нарушение функционирования сервиса.</li>
                    </ol>
                </li>
                <li>
                    Ответственность сторон
                    <ol>
                        <li>Компания не несет ответственности за возможные сбои и перерывы в работе сервиса, вызванные техническими неисправностями, действиями третьих лиц или форс-мажорными обстоятельствами.</li>
                        <li>Пользователь несет ответственность за достоверность предоставляемой информации и возможные последствия ее использования.</li>
                    </ol>
                </li>
                <li>
                    Заключительные положения
                    <ol>
                        <li>Компания оставляет за собой право вносить изменения в настоящее Соглашение в одностороннем порядке. Изменения вступают в силу с момента их публикации на сайте сервиса.</li>
                        <li>Все споры и разногласия, возникающие в связи с исполнением настоящего Соглашения, подлежат урегулированию путем переговоров. В случае невозможности урегулирования спора путем переговоров он подлежит рассмотрению в суде по месту нахождения Компании.
                            Настоящее Соглашение вступает в силу с момента его акцепта Пользователем и действует до момента его расторжения любой из сторон.</li>
                    </ol>
                </li>
            </ol>
        </article>
    </main-content-page-layout>
</template>
<style lang="scss" scoped>
.article-page-content {
    background-color: #fff;
    border-radius: 12px;
    padding: 24px;
    .thumbnail-side {
        margin: 0 0 24px;
    }
    h1,h2,h3,h4,h5 {
        margin: 0 0 12px;
    }
    ul, ol {
        font-family: var(--theme-font);
        padding-left: 18px;
        line-height: 1.5;
        font-weight: 400;
        font-size: 16px;
        li {
            margin-bottom: 12px;
            ol {
                margin-top: 12px;
            }
        }
    }
    p {
        margin: 0 0 12px;
        &:last-child {
            margin-bottom: 0;
        }
    }
}
</style>