<template>
    <main-content-layout>
        <article class="article-page-content">
            <div class="faq-container">
                <div class="flex-side list top w100 full">
                    <div class="one-column" v-for="(column, column_index) in faqs" :key="`faq-column-${column_index}`">
                        <one-faq-box v-for="(faq, faq_index) in column" :key="`faq-item-${faq_index}`" v-bind="faq" />
                    </div>
                </div>
            </div>
        </article>
    </main-content-layout>
</template>
<script>
export default {
    data() {
        return {
            faqs: []
        }
    },
    mounted() {
        this.init_faqs()
    },
    methods: {
        init_faqs: function() {
            const faqs_ready = []
            const faqs = [
                {
                    title: 'Как купить билет на концерт?',
                    description: 'Вы можете купить билет на нашем сайте, выбрав нужное мероприятие, выбрав места и оплатив заказ. Также доступны покупки через наше мобильное приложение.'
                },
                {
                    title: 'Какие способы оплаты доступны?',
                    description: 'Мы принимаем оплату через кредитные карты, безналичным расчетом. Также, доступны наличные расчеты в наших кассах.'
                },
                {
                    title: 'Могу ли я вернуть билет?',
                    description: 'Возврат билетов возможен в соответствии с нашей политикой возврата. Пожалуйста, ознакомьтесь с условиями на сайте или свяжитесь с нашей службой поддержки.'
                },
                {
                    title: 'Что делать, если я потерял билет?',
                    description: 'Утерянные билеты восстановлению не подлежат.'
                },
                {
                    title: 'Как узнать о предстоящих концертах?',
                    description: 'Следите за нашими обновлениями на сайте и в социальных сетях. Вы также можете подписаться на нашу рассылку, чтобы получать новости о новых мероприятиях и акциях.'
                },
                {
                    title: 'Как мне попасть на концерт?',
                    description: 'Информация о месте и времени проведения концерта указана на вашем билете. Рекомендуем приходить заранее, чтобы избежать задержек.'
                },
                {
                    title: 'Есть ли ограничения по возрасту для посещения концертов?',
                    description: 'Возрастные ограничения зависят от конкретного мероприятия. Пожалуйста, проверьте информацию на странице концерта.'
                },
                {
                    title: 'Могу ли я передать билет другому человеку?',
                    description: 'Билеты могут быть переданы, если это разрешено правилами конкретного мероприятия. Пожалуйста, проверьте условия на сайте.'
                },
                {
                    title: 'Что делать, если концерт отменён или перенесён?',
                    description: 'В случае отмены или переноса концерта мы уведомим вас по электронной почте, либо по закрепленному к билету телефонному номеру. Возврат средств будет осуществлён согласно правилам возврата билетов.'
                },
                {
                    title: 'Как связаться с службой поддержки?',
                    description: 'Вы можете связаться с нашей службой поддержки через форму на сайте, по телефону или в Telegram. Мы готовы помочь вам с любыми вопросами.'
                },
                {
                    title: 'Что такое физический билет?',
                    description: 'Физический билет — это бумажный билет, который вы можете приобрести в кассах. Вы должны взять этот билет с собой на мероприятие и не сможете попасть на мероприятие, если у вас физически нет билета.'
                },
                {
                    title: 'Что такое электронный билет?',
                    description: 'Электронный билет, как и бумажный, даёт право пройти на мероприятие, но за ним не нужно ездить в кассу — приобрести его вы можете на нашем сайте и в мобильном приложении и сразу после оплаты получить на почту. Хранить его можно на телефоне, планшете, компьютере. Главное преимущество – это невозможность потерять билет.'
                }
            ]
            // separate faqs into two columns to [[], []]
            const faqs_length = faqs.length
            const faqs_half = Math.ceil(faqs_length / 2)
            const faqs_first = faqs.slice(0, faqs_half)
            const faqs_second = faqs.slice(faqs_half, faqs_length)
            faqs_ready.push(faqs_first, faqs_second)

            this.faqs = faqs_ready
        }
    }
}
</script>
<style lang="scss" scoped>
.article-page-content {
    background-color: #fff;
    border-radius: 12px;
    padding: 24px;
    width: 100%;
    .thumbnail-side {
        margin: 0 0 24px;
    }
    h1,h2,h3,h4,h5 {
        margin: 0 0 12px;
    }
    ul, ol {
        padding-left: 18px;
    }
    p {
        margin: 0 0 12px;
        &:last-child {
            margin-bottom: 0;
        }
    }
}
</style>